LoadTests/user_post.yml
config:
  target: http://10.97.114.205:8081
  phases:
    - duration: 30
      arrivalRate: 50
      rampTo: 100
      name: Warm up phase
    - duration: 30
      arrivalRate: 100
      rampTo: 300
      name: High load ramp
    - duration: 60
      arrivalRate: 300
      rampTo: 400
      name: Sustained high load
  plugins:
    ensure: {}
    apdex: {}
    http.codes: {}
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
    - loop:
      - post:
         url: "/api/User"
         json:
          id: ""
          username: "t1"
          password: "123"
          role: "user"
          followers: "0"
          following: "0"
      count: 10