LoadTests/user_post.yml
config:
  target: http://10.104.31.154:8081
  phases:
#    - duration: 60
#      arrivalRate: 10
#      rampTo: 15
#      name: Warm up phase
#    - duration: 60
#      arrivalRate: 20
#      rampTo: 40
#      name: High load ramp
    - duration: 60
      arrivalRate: 400
      rampTo: 1000
      name: Sustained high load
  plugins:
    ensure: {}
    apdex: {}
    http.codes: {}
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
    - get:
       url: "/api/User/GetByUsername?name=t1&password=123"
   # - post:
   #    url: "/api/User"
   #    json:
 #       id: ""
 #       username: "t1"
 #       password: "123"
 #       role: "user"
 #       followers: "0"
 #       following: "0"