LoadTests/user_post.yml
#config:
 #target: http://10.101.148.52
 #phases:
 # - name: "Warm up"
    #duration: 60
   # arrivalRate: 10
  #  rampTo: 15
 # - name: "High load ramp up"
    #duration: 60
   # arrivalRate: 20
  #  rampTo: 40
 # - name: "Sustained high load"
    #duration: 30
   # arrivalRate: 40
  #  rampTo: 60
 #ensure:
 # maxErrorRate: 1

#scenarios:
   #- name: "Create user"
     #flow:
     # - post:
    #     url: "/api/User"
   #      json:
  #        id: ""
 #         username: "test1"
#          password: "123"
          #role: "user"
          #followers: "0"
          #following: "0"
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://10.101.148.52:8081
  phases:
    - duration: 1
      arrivalRate: 1
      rampTo: 1
      name: Warm up phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    http.codes: {}
  ensure:
      thresholds:
        - maxErrorRate: 5
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
    - post:
       url: "/api/User"
       json:
        id: ""
        username: "t1"
        password: "123"
        role: "user"
        followers: "0"
        following: "0"